### List of Changed Stacks

```bash
stacks/client-1
stacks/original
exitcode=0
stdout<<EOF
stacks/client-1
stacks/original
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master-module.aws_instance.master_instance must be replaced
-/+ resource "aws_instance" "master_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:295093822487:instance/i-0370291bf86c5bba9" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1e" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0370291bf86c5bba9" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e43200068a9d3d89" -> (known after apply)
      ~ private_dns                          = "ip-172-31-164-134.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.164.134" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          - "client-1_master_sg",
        ] -> (known after apply) # forces replacement
      + spot_instance_request_id             = (known after apply)
      ~ tags                                 = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_master_instance" -> "LibreMercado_master_instance"
        }
      ~ tags_all                             = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_master_instance" -> "LibreMercado_master_instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0fff1229c4a4ceabf",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0825df387180cfb56" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # module.master-module.aws_subnet.master_public_subnet will be updated in-place
  ~ resource "aws_subnet" "master_public_subnet" {
        id                                             = "subnet-0d8fef710a4e76c57"
      ~ tags                                           = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_master_subnet" -> "LibreMercado_master_subnet"
        }
      ~ tags_all                                       = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_master_subnet" -> "LibreMercado_master_subnet"
        }
        # (15 unchanged attributes hidden)
    }

  # module.master-module.aws_vpc_security_group_egress_rule.allow_slave_egress must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-001f320b56ef2f187" -> (known after apply)
      ~ id                           = "sgr-001f320b56ef2f187" -> (known after apply)
      ~ referenced_security_group_id = "sg-023f907bda8c88b21" -> (known after apply)
      ~ security_group_id            = "sg-0fff1229c4a4ceabf" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-001f320b56ef2f187" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_internet_traffic_global must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      ~ arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-0dee8927855178b3c" -> (known after apply)
      ~ id                     = "sgr-0dee8927855178b3c" -> (known after apply)
      ~ security_group_id      = "sg-0fff1229c4a4ceabf" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0dee8927855178b3c" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_slave_ingress must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-06a6e998e878631e8" -> (known after apply)
      ~ id                           = "sgr-06a6e998e878631e8" -> (known after apply)
      ~ referenced_security_group_id = "sg-023f907bda8c88b21" -> (known after apply)
      ~ security_group_id            = "sg-0fff1229c4a4ceabf" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-06a6e998e878631e8" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sg.aws_security_group.master_sg must be replaced
-/+ resource "aws_security_group" "master_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-0fff1229c4a4ceabf" -> (known after apply)
      ~ description            = "Allow inbound traffic and all outbound traffic to the master of client-1" -> "Allow inbound traffic and all outbound traffic to the master of LibreMercado" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-023f907bda8c88b21",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0fff1229c4a4ceabf" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-023f907bda8c88b21",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "client-1_master_sg" -> "LibreMercado_master_sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "295093822487" -> (known after apply)
      ~ tags                   = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_master_sg" -> "LibreMercado_master_sg"
        }
      ~ tags_all               = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_master_sg" -> "LibreMercado_master_sg"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sg.aws_security_group.slave_sg must be replaced
-/+ resource "aws_security_group" "slave_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-023f907bda8c88b21" -> (known after apply)
      ~ description            = "Segurity group for the slave structure of the client client-1" -> "Segurity group for the slave structure of the client LibreMercado" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Egress rule that allow the slave to communicate with the master instance"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0fff1229c4a4ceabf",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-023f907bda8c88b21" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress rule that allow the slave to communicate with the master instance"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0fff1229c4a4ceabf",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "client-1_slave_sg" -> "LibreMercado_slave_sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "295093822487" -> (known after apply)
      ~ tags                   = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_slave_sg" -> "LibreMercado_slave_sg"
        }
      ~ tags_all               = {
          ~ "Client" = "client-1" -> "LibreMercado"
          ~ "Name"   = "client-1_slave_sg" -> "LibreMercado_slave_sg"
        }
        # (2 unchanged attributes hidden)
    }

  # module.slave-module.aws_autoscaling_group.slave_asg must be replaced
-/+ resource "aws_autoscaling_group" "slave_asg" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:295093822487:autoScalingGroup:350a330a-d0fd-46a7-a54c-be48c11d6e6e:autoScalingGroupName/client-1_asg" -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "client-1_asg" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ name                             = "client-1_asg" -> "LibreMercado_asg" # forces replacement
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::295093822487:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ vpc_zone_identifier              = [] -> (known after apply)
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-059699dc81a1b23e7" -> (known after apply)
          ~ name    = "client-1_template20240509214353783700000001" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_launch_template.slave_launch_template must be replaced
-/+ resource "aws_launch_template" "slave_launch_template" {
      ~ arn                     = "arn:aws:ec2:us-east-1:295093822487:launch-template/lt-059699dc81a1b23e7" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-059699dc81a1b23e7" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "client-1_template20240509214353783700000001" -> (known after apply)
      ~ name_prefix             = "client-1_template" -> "LibreMercado_template" # forces replacement
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
      ~ vpc_security_group_ids  = [
          - "sg-023f907bda8c88b21",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tag_specifications {
          ~ tags          = {
              ~ "Client" = "client-1" -> "LibreMercado"
              ~ "Name"   = "client-1" -> "LibreMercado"
            }
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_subnet.slave_public_subnet will be updated in-place
  ~ resource "aws_subnet" "slave_public_subnet" {
        id                                             = "subnet-01947d9546a32657e"
      ~ tags                                           = {
          ~ "Name" = "client-1_slave_subnet" -> "LibreMercado_slave_subnet"
        }
      ~ tags_all                                       = {
          ~ "Name" = "client-1_slave_subnet" -> "LibreMercado_slave_subnet"
        }
        # (15 unchanged attributes hidden)
    }

  # module.slave-module.aws_vpc_security_group_egress_rule.egress_from_master_sg must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-0bdd073475191e227" -> (known after apply)
      ~ id                           = "sgr-0bdd073475191e227" -> (known after apply)
      ~ referenced_security_group_id = "sg-0fff1229c4a4ceabf" -> (known after apply)
      ~ security_group_id            = "sg-023f907bda8c88b21" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-0bdd073475191e227" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.ingress_from_master_sg must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-061e0fa6ea296df52" -> (known after apply)
      ~ id                           = "sgr-061e0fa6ea296df52" -> (known after apply)
      ~ referenced_security_group_id = "sg-0fff1229c4a4ceabf" -> (known after apply)
      ~ security_group_id            = "sg-023f907bda8c88b21" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-061e0fa6ea296df52" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 10 to add, 2 to change, 10 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.master_instance must be replaced
-/+ resource "aws_instance" "master_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:295093822487:instance/i-0a157bc1a0e2f4428" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1e" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0a157bc1a0e2f4428" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ instance_type                        = "t2.large" -> "t2.2xlarge"
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-07820bdf7d92a9eb6" -> (known after apply)
      ~ private_dns                          = "ip-172-31-156-154.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.156.154" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          - "original_implementation_master_sg",
          + "sg-06121969ad77f570f",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Client" = "original_implementation"
            "Name"   = "original_implementation_master_instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-06121969ad77f570f",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0b4f0a71e280865b6" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->